private_dot_config/doom/config.org
:PROPERTIES:
:header-args:emacs-lisp: :comments link :results none
:END:
#+title: Config
* toc :TOC:
- [[#variables][Variables]]
  - [[#large-files-warning][Large files warning]]
  - [[#uniquify-buffer-name][Uniquify buffer name]]
- [[#id][ID]]
- [[#ui][UI]]
  - [[#font][Font]]
  - [[#theme][Theme]]
  - [[#display-line][Display line]]
  - [[#dashboard][Dashboard]]
- [[#coding][Coding]]
- [[#modes][Modes]]
  - [[#org][ORG]]
  - [[#latex][Latex]]
  - [[#calibre][Calibre]]
  - [[#lsp][LSP]]
  - [[#ace-window][Ace window]]
  - [[#evil][Evil]]
  - [[#vterm][Vterm]]
  - [[#corfu][Corfu]]
  - [[#dirvish][Dirvish]]
  - [[#projectile][Projectile]]
  - [[#openwith][Openwith]]
  - [[#ispell][Ispell]]
  - [[#web-development][Web development]]
  - [[#sql][SQL]]
  - [[#just][Just]]
  - [[#python][Python]]
  - [[#rust][Rust]]

* Variables

some modes use home row, modify for colemak-dh

#+begin_src emacs-lisp :tangle yes :shebang ";;; -*- lexical-binding: t; -*-"
(setq home-row-keys '(?a ?t ?n ?o ?d ?h ?r ?i ?s ?e))
#+end_src

** Large files warning

Disable warning for large files

#+begin_src emacs-lisp :tangle yes
(setq large-file-warning-threshold nil)
#+end_src


** Uniquify buffer name

[[https://github.com/doomemacs/doomemacs/issues/6205][#6205]]
set uniquify-buffer-name-style after +workspaces-init-persp-mode-h

#+begin_src emacs-lisp :tangle yes
(after! persp-mode
  (add-hook! 'persp-mode-hook :depth 5
             (setq uniquify-buffer-name-style 'post-forward-angle-brackets)
             ))
#+end_src

* ID
Some functionality uses this to identify you, e.g. GPG configuration, email clients, file templates and snippets.

#+begin_src emacs-lisp :tangle yes
(setq user-full-name "Reinaldo Ossuna"
      user-mail-address "reinaldo.ossuna@gmail.com")
#+end_src

* UI
** Font
#+begin_src emacs-lisp :tangle yes
(setq doom-font (font-spec :family "Iosevka Term Curly" :size 18  :weight 'regular)
      doom-variable-pitch-font (font-spec :family "DejaVu Sans" :size 13)
      doom-symbol-font (font-spec :family "JuliaMono")
      doom-big-font (font-spec :family "JetBrainsMono" :size 24))
#+end_src

** Theme
#+begin_src emacs-lisp :tangle yes
(setq doom-theme 'doom-vibrant)
(setq doom-vibrant-padded-modeline t)
#+end_src

** Display line

This determines the style of line numbers in effect. If set to "nil", line numbers are disabled. For relative line numbers, set this to "relative".

#+begin_src emacs-lisp :tangle yes
(setq display-line-numbers-type t)
#+end_src

** Dashboard
- modify image
- remove menus
- remove modeline
- remove cursor
#+begin_src emacs-lisp :tangle yes
(setq fancy-splash-image
      (concat doom-user-dir "third-eye-logo.png"))
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)
(add-hook! '+doom-dashboard-mode-hook (hide-mode-line-mode 1) (hl-line-mode -1))
(setq-hook! '+doom-dashboard-mode-hook evil-normal-state-cursor (list nil))
#+end_src

* Coding

#+begin_src emacs-lisp :tangle yes
(map!
 (:desc "Go to line" :nv "gl" #'evil-avy-goto-line
  :desc "copy line" :nv "ghl" 'avy-copy-line
  :desc "copy region" :nv "ghr" 'avy-copy-region
  :desc "move line" :nv "ghL" 'avy-move-line
  :desc "move region" :nv "ghR" 'avy-move-region
 )
 (:map doom-leader-code-map
  :desc "Un/Comment region" "/" #'comment-or-uncomment-region
  )
 (:map doom-leader-project-map
  :desc "Find recent file" "R" 'projectile-recentf
  :desc "Run project" "r"  'projectile-run-project
  :desc "GDB" "G" 'projectile-run-gdb
  )
 )
#+end_src


#+begin_src emacs-lisp :tangle yes
(map!
 (:map compilation-mode-map
       (:localleader
        :n "k" 'kill-compilation
        :n "j" 'compilation-next-error
        :n "n" 'compilation-previous-error
        )
       )
 )
#+end_src


* Modes
** ORG

If you use "org" and don't want your org files in the default location below, change "org-directory". It must be set before org loads!

#+begin_src emacs-lisp :tangle yes
(setq org-roam-directory "~/org/roam")
(setq org-directory "~/org/")

(after! org
  (global-org-modern-mode)
  )
#+end_src
*** org-latex

#+begin_src emacs-lisp :tangle yes
(require 'ox-latex)
(after! org
  (setq org-latex-compiler "lualatex")
  (setq org-latex-pdf-process
      '("latexmk -f -pdf -%latex -interaction=nonstopmode -synctex=1 -file-line-error -shell-escape -output-directory=%o %f"))
  (setq org-latex-src-block-backend 'minted)
  (add-to-list 'org-latex-packages-alist '("newfloat" "minted"))
  (setq org-latex-minted-options '(("bgcolor" . "bg") ("breaklines")))
  (setq org-export-with-toc nil)
  )
#+end_src


#+begin_src emacs-lisp :tangle yes
(setq org-latex-classes
        '(("article"
           "\\RequirePackage{fix-cm}
\\PassOptionsToPackage{svgnames}{xcolor}
\\documentclass[11pt]{article}
\\usepackage{fontspec}
\\usepackage{libertine}
\\usepackage{datetime2}
\\usepackage{sectsty}
\\allsectionsfont{\\sffamily}
\\usepackage{enumitem}
\\setlist[description]{style=unboxed,font=\\sffamily\\bfseries}
\\usepackage{listings}
\\lstset{frame=single,aboveskip=1em,
	framesep=.5em,backgroundcolor=\\color{AliceBlue},
	rulecolor=\\color{LightSteelBlue},framerule=1pt}
\\usepackage{xcolor}
\\newcommand\\basicdefault[1]{\\scriptsize\\color{Black}\\ttfamily#1}
\\lstset{basicstyle=\\basicdefault{\\spaceskip1em}}
\\usepackage[a4paper,top=3.5cm,left=3cm,right=3cm,bottom=2.5cm]{geometry}
\\usepackage[bf,sf,footnotesize,indent]{caption}
\\setlength{\\captionmargin}{0.8cm}
\\renewcommand{\\captionfont}{\\sffamily\\footnotesize\\bfseries}
\\parindent 1.27cm
\\parskip   6pt
\\flushbottom
\\usepackage{parskip}
\\makeatletter
\\renewcommand{\\maketitle}{%
  \\begingroup\\parindent0pt
  \\sffamily
  \\Huge{\\bfseries\\@title}\\par\\bigskip
  \\LARGE{\\bfseries\\@author}\\par\\medskip
  \\normalsize\\@date\\par\\bigskip
  \\endgroup\\@afterindentfalse\\@afterheading}
\\makeatother
[DEFAULT-PACKAGES]
\\AtBeginDocument{\\renewcommand{\\UrlFont}{\\ttfamily}}
[PACKAGES]
[EXTRA]

\\usepackage{tcolorbox}
\\tcbuselibrary{listings, minted, skins}
\\tcbset{listing engine=minted}

\\definecolor{bg}{RGB}{22,43,58}
"
           ("\\section{%s}" . "\\section*{%s}")
           ("\\subsection{%s}" . "\\subsection*{%s}")
           ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
           ("\\paragraph{%s}" . "\\paragraph*{%s}")
           ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))

          ("report" "\\documentclass[11pt]{report}"
           ("\\part{%s}" . "\\part*{%s}")
           ("\\chapter{%s}" . "\\chapter*{%s}")
           ("\\section{%s}" . "\\section*{%s}")
           ("\\subsection{%s}" . "\\subsection*{%s}")
           ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))

          ("sbc" "\\documentclass[12pt]{article}
\\usepackage{sbc-template}
\\bibliographystyle{sbc}
\\usepackage{graphicx,url}
\\usepackage[utf8]{inputenc}
\\usepackage[brazil]{babel}
\\usepackage[latin1]{inputenc}

\\sloppy

\\AtBeginDocument{\\definecolor{bg}{rgb}{0.95,0.95,0.95}}
\\AtEndDocument{\\printbibliography}
[PACKAGES]
[EXTRA]"
           ("\\section{%s}" . "\\section*{%s}")
           ("\\subsection{%s}" . "\\subsection*{%s}")
           ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
           ("\\paragraph{%s}" . "\\paragraph*{%s}")
           ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))
  ))
#+end_src
