private_dot_config/doom/executable_config.el
;;; -*- lexical-binding: t; -*-
;; [[file:config.org::*Variables][Variables:1]]
(setq home-row-keys '(?a ?t ?n ?o ?d ?h ?r ?i ?s ?e))
;; Variables:1 ends here

;; [[file:config.org::*Large files warning][Large files warning:1]]
(setq large-file-warning-threshold nil)
;; Large files warning:1 ends here

;; [[file:config.org::*Uniquify buffer name][Uniquify buffer name:1]]
(after! persp-mode
  (add-hook! 'persp-mode-hook :depth 5
             (setq uniquify-buffer-name-style 'post-forward-angle-brackets)
             ))
;; Uniquify buffer name:1 ends here

;; [[file:config.org::*ID][ID:1]]
(setq user-full-name "Reinaldo Ossuna"
      user-mail-address "reinaldo.ossuna@gmail.com")
;; ID:1 ends here

;; [[file:config.org::*Font][Font:1]]
(setq doom-font (font-spec :family "Iosevka Term Curly" :size 18  :weight 'regular)
      doom-variable-pitch-font (font-spec :family "DejaVu Sans" :size 13)
      doom-symbol-font (font-spec :family "JuliaMono")
      doom-big-font (font-spec :family "JetBrainsMono" :size 24))
;; Font:1 ends here

;; [[file:config.org::*Theme][Theme:1]]
(setq doom-theme 'doom-vibrant)
(setq doom-vibrant-padded-modeline t)
;; Theme:1 ends here

;; [[file:config.org::*Display line][Display line:1]]
(setq display-line-numbers-type t)
;; Display line:1 ends here

;; [[file:config.org::*Dashboard][Dashboard:1]]
(setq fancy-splash-image
      (concat doom-user-dir "third-eye-logo.png"))
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)
(add-hook! '+doom-dashboard-mode-hook (hide-mode-line-mode 1) (hl-line-mode -1))
(setq-hook! '+doom-dashboard-mode-hook evil-normal-state-cursor (list nil))
;; Dashboard:1 ends here

;; [[file:config.org::*Coding][Coding:1]]
(map!
 (:desc "Go to line" :nv "gl" #'evil-avy-goto-line
  :desc "copy line" :nv "ghl" 'avy-copy-line
  :desc "copy region" :nv "ghr" 'avy-copy-region
  :desc "move line" :nv "ghL" 'avy-move-line
  :desc "move region" :nv "ghR" 'avy-move-region
 )
 (:map doom-leader-code-map
  :desc "Un/Comment region" "/" #'comment-or-uncomment-region
  )
 (:map doom-leader-project-map
  :desc "Find recent file" "R" 'projectile-recentf
  :desc "Run project" "r"  'projectile-run-project
  :desc "GDB" "G" 'projectile-run-gdb
  )
 )
;; Coding:1 ends here

;; [[file:config.org::*Coding][Coding:2]]
(map!
 (:map compilation-mode-map
       (:localleader
        :n "k" 'kill-compilation
        :n "j" 'compilation-next-error
        :n "n" 'compilation-previous-error
        )
       )
 )
;; Coding:2 ends here

;; [[file:config.org::*ORG][ORG:1]]
(setq org-roam-directory "~/org/roam")
(setq org-directory "~/org/")

(after! org
  (global-org-modern-mode)
  )
;; ORG:1 ends here

;; [[file:config.org::*org-latex][org-latex:1]]
(require 'ox-latex)
(after! org
  (setq org-latex-compiler "lualatex")
  (setq org-latex-pdf-process
      '("latexmk -f -pdf -%latex -interaction=nonstopmode -synctex=1 -file-line-error -shell-escape -output-directory=%o %f"))
  (setq org-latex-src-block-backend 'minted)
  (add-to-list 'org-latex-packages-alist '("newfloat" "minted"))
  (setq org-latex-minted-options '(("bgcolor" . "bg") ("breaklines")))
  (setq org-export-with-toc nil)
  )
;; org-latex:1 ends here

;; [[file:config.org::*org-latex][org-latex:2]]
(setq org-latex-classes
        '(("article"
           "\\RequirePackage{fix-cm}
\\PassOptionsToPackage{svgnames}{xcolor}
\\documentclass[11pt]{article}
\\usepackage{fontspec}
\\usepackage{libertine}
\\usepackage{datetime2}
\\usepackage{sectsty}
\\allsectionsfont{\\sffamily}
\\usepackage{enumitem}
\\setlist[description]{style=unboxed,font=\\sffamily\\bfseries}
\\usepackage{listings}
\\lstset{frame=single,aboveskip=1em,
	framesep=.5em,backgroundcolor=\\color{AliceBlue},
	rulecolor=\\color{LightSteelBlue},framerule=1pt}
\\usepackage{xcolor}
\\newcommand\\basicdefault[1]{\\scriptsize\\color{Black}\\ttfamily#1}
\\lstset{basicstyle=\\basicdefault{\\spaceskip1em}}
\\usepackage[a4paper,top=3.5cm,left=3cm,right=3cm,bottom=2.5cm]{geometry}
\\usepackage[bf,sf,footnotesize,indent]{caption}
\\setlength{\\captionmargin}{0.8cm}
\\renewcommand{\\captionfont}{\\sffamily\\footnotesize\\bfseries}
\\parindent 1.27cm
\\parskip   6pt
\\flushbottom
\\usepackage{parskip}
\\makeatletter
\\renewcommand{\\maketitle}{%
  \\begingroup\\parindent0pt
  \\sffamily
  \\Huge{\\bfseries\\@title}\\par\\bigskip
  \\LARGE{\\bfseries\\@author}\\par\\medskip
  \\normalsize\\@date\\par\\bigskip
  \\endgroup\\@afterindentfalse\\@afterheading}
\\makeatother
[DEFAULT-PACKAGES]
\\AtBeginDocument{\\renewcommand{\\UrlFont}{\\ttfamily}}
[PACKAGES]
[EXTRA]

\\usepackage{tcolorbox}
\\tcbuselibrary{listings, minted, skins}
\\tcbset{listing engine=minted}

\\definecolor{bg}{RGB}{22,43,58}
"
           ("\\section{%s}" . "\\section*{%s}")
           ("\\subsection{%s}" . "\\subsection*{%s}")
           ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
           ("\\paragraph{%s}" . "\\paragraph*{%s}")
           ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))

          ("report" "\\documentclass[11pt]{report}"
           ("\\part{%s}" . "\\part*{%s}")
           ("\\chapter{%s}" . "\\chapter*{%s}")
           ("\\section{%s}" . "\\section*{%s}")
           ("\\subsection{%s}" . "\\subsection*{%s}")
           ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))

          ("sbc" "\\documentclass[12pt]{article}
\\usepackage{sbc-template}
\\bibliographystyle{sbc}
\\usepackage{graphicx,url}
\\usepackage[utf8]{inputenc}
\\usepackage[brazil]{babel}
\\usepackage[latin1]{inputenc}

\\sloppy

\\AtBeginDocument{\\definecolor{bg}{rgb}{0.95,0.95,0.95}}
\\AtEndDocument{\\printbibliography}
[PACKAGES]
[EXTRA]"
           ("\\section{%s}" . "\\section*{%s}")
           ("\\subsection{%s}" . "\\subsection*{%s}")
           ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
           ("\\paragraph{%s}" . "\\paragraph*{%s}")
           ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))
  ))
;; org-latex:2 ends here
