private_dot_config/doom/executable_config.el

;; [[file:config.org::*jupyter][jupyter:1]]
(add-to-list 'org-default-properties "header-args")
(add-to-list 'org-structure-template-alist '("jupyter" . "src jupyter-python"))

(setq my/jupyter-runtime-folder (expand-file-name "~/.local/share/jupyter/runtime"))

(defun my/list-jupyter-kernel-files ()
  (mapcar
   (lambda (file) (cons (car file) (cdr (assq 'shell_port (json-read-file (car file))))))
   (sort
    (directory-files-and-attributes my/jupyter-runtime-folder t ".*kernel.*json$")
    (lambda (x y) (not (time-less-p (nth 6 x) (nth 6 y)))))))

(defun my/get-open-ports ()
  (mapcar
   #'string-to-number
   (split-string (shell-command-to-string "ss -tulpnH | awk '{print $5}' | sed -e 's/.*://'") "\n")))

(defun my/select-jupyter-kernel ()
  (let ((ports (my/get-open-ports))
        (files (my/list-jupyter-kernel-files)))
    (completing-read
     "Jupyter kernels: "
     (seq-filter
      (lambda (file)
        (member (cdr file) ports))
      files)))
  )

(defun my/insert-jupyter-kernel ()
  "Insert a path to an active Jupyter kernel into the buffer"
  (interactive)
  (insert (my/select-jupyter-kernel)))

(defun my/jupyter-connect-repl ()
  "Open emacs-jupyter REPL, connected to a Jupyter kernel"
  (interactive)
  (jupyter-connect-repl (my/select-jupyter-kernel) nil nil nil t))

(defun my/jupyter-console ()
  "Open Jupyter Console, connected to a Jupyter kernel"
  (interactive)
  (start-process "jupyter-console" nil "zellij" "run" "--" "jupyter" "console" "--existing"
                 (file-name-nondirectory (my/select-jupyter-kernel))))

(defun my/jupyter-cleanup-kernels ()
  (interactive)
  (let* ((ports (my/get-open-ports))
         (files (my/list-jupyter-kernel-files))
         (to-delete (seq-filter
                     (lambda (file)
                       (not (member (cdr file) ports)))
                     files)))
    (when (and (length> to-delete 0)
               (y-or-n-p (format "Delete %d files?" (length to-delete))))
      (dolist (file to-delete)
        (delete-file (car file))))))

(with-eval-after-load 'jupyter-client
  (defun my/jupyter-remove-empty-async-results (args)
    (let*
        ((req (nth 1 args))
         (msg (nth 2 args))
         (is-org-request (eq (type-of req) 'jupyter-org-request)))
      (when is-org-request
        (jupyter-with-message-content msg (status payload)
          (when (and (jupyter-org-request-async-p req)
                     (equal status "ok")
                     (not (jupyter-org-request-id-cleared-p req)))
            (jupyter-org--clear-request-id req)
            (org-with-point-at (jupyter-org-request-marker req)
              (org-babel-remove-result)))))
      args))

  (unless (advice-member-p #'my/jupyter-remove-empty-async-results 'jupyter-handle-execute-reply)
    (advice-add 'jupyter-handle-execute-reply :filter-args #'my/jupyter-remove-empty-async-results)))
;; jupyter:1 ends here

;; [[file:config.org::*Latex][Latex:1]]
(add-hook! 'LaTeX-mode-hook
           (TeX-engine-set 'luatex)
           (TeX-fold-mode t)
  )
(setq-hook! 'LaTeX-mode-hook
  TeX-PDF-mode t
  TeX-command-extra-options "-synctex=1"
  TeX-source-correlate-mode t
  )
;; Latex:1 ends here

;; [[file:config.org::*Calibre][Calibre:1]]
(use-package! calibredb
  :defer t
  :config
  (setq! calibredb-program "/usr/bin/calibredb"
         calibredb-root-dir "~/Documents/Books/"
         calibredb-format-all-the-icons t
         calibredb-format-character-icons t
         calibredb-db-dir (expand-file-name "metadata.db" calibredb-root-dir)
         )
  (set-popup-rule! "^\\*calibredb-entry" :vslot 5 :side 'right :size 0.4 :select nil)
  (set-popup-rule! "^\\*Help" :side 'bottom :size 0.3 :select nil)
  (set-popup-rule! "^\\*undo-tree" :side 'right :select t :vslot 2)
  )
;; Calibre:1 ends here

;; [[file:config.org::*Keybindings][Keybindings:1]]
(map!
 (:map doom-leader-open-map
       "c" #'calibredb)
 (:map calibredb-search-mode-map
  :n "?" 'calibredb-dispatch
  :n "/" 'calibredb-search-live-filter
  :n "<RET>" 'calibredb-find-file
  :n "o" 'calibredb-find-file
  :n "O" 'calibredb-find-file-other-frame
  :n "r" 'calibredb-search-refresh-and-clear-filter
  :n "q" 'calibredb-search-quit
  :n "a" 'calibredb-add
  :n "F" 'calibredb-fetch-and-set-metadata-by-author-and-title
  )
 )
;; Keybindings:1 ends here

;; [[file:config.org::*LSP][LSP:1]]
(after! lsp-mode
  (setq! lsp-rust-server 'rust-analyzer
         lsp-ui-sideline-actions-icon nil
         lsp-ui-sideline-show-diagnostics t
         lsp-rust-analyzer-server-display-inlay-hints t
         lsp-headerline-breadcrumb-enable t
         lsp-ui-doc-show-with-cursor nil
         lsp-ui-sideline-show-hover nil
         lsp-signature-auto-activate nil
         lsp-signature-render-documentation t
         lsp-rust-clippy-preference "on"
         lsp-rust-analyzer-cargo-watch-command "clippy"
         lsp-diagnostics-provider :flycheck))
;; LSP:1 ends here

;; [[file:config.org::*LSP][LSP:2]]
(after! lsp-clangd
  (set-lsp-priority! 'clangd 2)
  (setq lsp-clients-clangd-args '("-j=5"
                                  "--all-scopes-completion"
                                  "--fallback-style=Chromium"
                                  "--background-index"
                                  "--clang-tidy"
                                  "--completion-style=detailed"
                                  "--header-insertion=never"
                                  "--function-arg-placeholders"
                                  "--suggest-missing-includes"))
  (set-popup-rule! "^\\*LSP Error List" :size 0.2 :quit t :select t)
  )
;; LSP:2 ends here

;; [[file:config.org::*Ace window][Ace window:1]]
(use-package! ace-window
  :config
  (setq! aw-keys home-row-keys
         aw-ignore-current t)
  (custom-set-faces!
    '(aw-leading-char-face
      :foreground "white" :background "red"
      :weight bold :height 1.5 :box (:line-width 3 :color "red"))))
;; Ace window:1 ends here

;; [[file:config.org::*Evil][Evil:1]]
(after! evil
  (modify-syntax-entry ?_ "w")
  )
;; Evil:1 ends here

;; [[file:config.org::*Evil][Evil:2]]
(map!
 :nv "+" 'evil-numbers/inc-at-pt
 )
;; Evil:2 ends here

;; [[file:config.org::*Snipe][Snipe:1]]
(after! evil-snipe
  (setq! evil-snipe-scope 'whole-visible
         evil-snipe-spillover-scope 'whole-buffer
         evil-snipe-repeat-scope 'whole-buffer)
  )
;; Snipe:1 ends here

;; [[file:config.org::*Avy][Avy:1]]
(after! avy
  (setq! avy-style 'de-bruijn
         avy-keys  home-row-keys
         )
  )
;; Avy:1 ends here

;; [[file:config.org::*Keybindings][Keybindings:1]]
(map! :map evil-window-map
      :desc "Ace window" "a" 'ace-window
      :desc "enlarge" "|" (cmd! (evil-window-set-width 90))
      )
;; Keybindings:1 ends here

;; [[file:config.org::*Vterm][Vterm:1]]
(setq shell-file-name (executable-find "zsh"))

(after! vterm
  (setq-default vterm-shell shell-file-name)
  )
;; Vterm:1 ends here

;; [[file:config.org::*Keybindings][Keybindings:1]]
(map!
 (:map doom-leader-open-map
       "t" #'+vterm/here
       "T" nil)
 (:map doom-leader-toggle-map
  :desc "Toggle vterm" "t" #'+vterm/toggle)
 (:map vterm-mode-map
       "C-k" #'vterm-send-escape)
 )

(which-key-add-key-based-replacements "SPC t t" "Toggle vterm")
(which-key-add-key-based-replacements "SPC o t" "Open vterm here")
;; Keybindings:1 ends here

;; [[file:config.org::*Dirvish][Dirvish:1]]
(after! dirvish
