private_dot_config/doom/config.org
** Dirvish
#+begin_src emacs-lisp :tangle yes
(after! dirvish
  (setq dirvish-quick-access-entries
        '(("h" "~/"                          "Home")
          ("d" "~/Documents/"                "Documents")
          ("D" "~/Downloads/"                "Downloads")))

  (setq!
   dired-listing-switches "-l --almost-all --human-readable --group-directories-first --no-group"
   dirvish-hide-details t
   dirvish-attributes '(vc-state subtree-state nerd-icons collapse git-msg file-time file-size)
   dirvish-mode-line-format '(:left (sort symlink) :right (omit yank index))
   )
  )
#+end_src

** Projectile
#+begin_src emacs-lisp :tangle yes
(setq
 projectile-project-search-path '(("~/Projects/" . 2))
 projectile-enable-cmake-presets t)
#+end_src

** Openwith

#+begin_src emacs-lisp :tangle yes
(use-package! openwith
  :config
  (openwith-mode t)

  (setq openwith-associations
        (list
         (list (openwith-make-extension-regexp
                '("mpg" "mpeg" "mp3" "mp4"
                  "avi" "wmv" "wav" "mov" "flv"
                  "ogm" "ogg" "mkv"))
               "mpv" '(file))

         (list (openwith-make-extension-regexp
                '("epub" "azw3"))
               "ebook-viewer" '(file))
         ))
  )

#+end_src

** Ispell

#+begin_src emacs-lisp :tangle yes
(after! ispell
  (ispell-set-spellchecker-params)
  (ispell-hunspell-add-multi-dic  "pt_BR,english")
  (setq ispell-dictionary "pt_BR,english"
        ispell-personal-dictionary "~/.hunspell_personal"
        )
  )

(after! flyspell
  (setq flyspell-lazy-idle-seconds 3)
  (setq flyspell-lazy-window-idle-seconds 30))
#+end_src

** Web development

#+begin_src emacs-lisp :tangle no
(use-package! lsp-tailwindcss
  :init
  (setq lsp-tailwindcss-add-on-mode t))
#+end_src

** SQL
#+begin_src emacs-lisp :tangle no
(add-hook 'sql-mode-hook 'lsp)
(setq lsp-sqls-workspace-config-path nil)
(setq lsp-sqls-connections
      '((driver . "postgres") (dataSourceName . "host=127.0.0.1 port=5432 user=postgres password=example dbname=postgres sslmode=disable")))


(map! :map sql-mode-map
      :localleader
      (:prefix ("e" . "execute")
       :desc "paragraph" "p" #'lsp-sql-execute-paragraph
       :desc "buffer" "b" #'lsp-sql-execute-query
       )
      :desc "Select product" "p" #'sql-set-product
      :desc "Run product repl" "r" #'sql-product-interactive
      :desc "switch connection" "s" 'lsp-sql-switch-connection
      )
#+end_src

** Just

#+begin_src emacs-lisp :tangle yes

(after! projectile
  (add-to-list 'projectile-project-root-files "justfile")
  (add-to-list 'projectile-project-types '(just marker-files ("justfile") project-file "justfile" compilation-dir nil
                                           configure-command "just config" compile-command "just build" test-command
                                           "just test" install-command "just install" package-command nil
                                           run-command "just run"))
  )

(use-package! justl
  :config
  (map!
   (:map justl-mode-map
    :n "e" #'justl-exec-recipe
    :n "E" #'justl-exec-vterm
    :n "w" #'justl-no-exec-vterm
    :n "f" #'justl-go-to-file
    )
   :leader :desc "justl" :n "j" #'justl
   ))
#+end_src

** Python

ipython command need to be absolute

#+begin_src emacs-lisp :tangle yes
(after! python
  (setq! +python-ipython-command '("/usr/bin/ipython" "-i" "--simple-prompt" "--no-color-info"))
  (add-hook 'python-mode-hook 'code-cells-mode-maybe)
(after! code-cells
  (map!
   :map code-cells-mode-map
   "C-n" #'code-cells-forward-cell
   :desc "execute cell" "C-c C-c" #'code-cells-eval
   :desc "execute buffer" "C-c C-b" #'python-shell-send-buffer
   :localleader
   :desc "cells" "c" 'code-cells-mode-map
   ))
  )
#+end_src

** Rust

Remap of some commands, [[file:/hdd/home/nardo/.config/emacs/modules/lang/rust/config.el::(map! :map rustic-mode-map][more commands]].
#+begin_src emacs-lisp :tangle yes
(after! rustic rust
  (map!
   :map rustic-mode-map
   :localleader
   :desc "cargo outdated"       "o" #'rustic-cargo-outdated
   :desc "cargo add"            "a" #'rustic-cargo-add
   :desc "cargo add missing"    "A" #'rustic-cargo-add-missing-dependencies
   :desc "visic Cargo.toml"     "t" #'lsp-rust-analyzer-open-cargo-toml
))
#+end_src
