private_dot_config/doom/executable_config.el
  (setq dirvish-quick-access-entries
        '(("h" "~/"                          "Home")
          ("d" "~/Documents/"                "Documents")
          ("D" "~/Downloads/"                "Downloads")))

  (setq!
   dired-listing-switches "-l --almost-all --human-readable --group-directories-first --no-group"
   dirvish-hide-details t
   dirvish-attributes '(vc-state subtree-state nerd-icons collapse git-msg file-time file-size)
   dirvish-mode-line-format '(:left (sort symlink) :right (omit yank index))
   )
  )
;; Dirvish:1 ends here

;; [[file:config.org::*Projectile][Projectile:1]]
(setq
 projectile-project-search-path '(("~/Projects/" . 2))
 projectile-enable-cmake-presets t)
;; Projectile:1 ends here

;; [[file:config.org::*Openwith][Openwith:1]]
(use-package! openwith
  :config
  (openwith-mode t)

  (setq openwith-associations
        (list
         (list (openwith-make-extension-regexp
                '("mpg" "mpeg" "mp3" "mp4"
                  "avi" "wmv" "wav" "mov" "flv"
                  "ogm" "ogg" "mkv"))
               "mpv" '(file))

         (list (openwith-make-extension-regexp
                '("epub" "azw3"))
               "ebook-viewer" '(file))
         ))
  )
;; Openwith:1 ends here

;; [[file:config.org::*Ispell][Ispell:1]]
(after! ispell
  (ispell-set-spellchecker-params)
  (ispell-hunspell-add-multi-dic  "pt_BR,english")
  (setq ispell-dictionary "pt_BR,english"
        ispell-personal-dictionary "~/.hunspell_personal"
        )
  )

(after! flyspell
  (setq flyspell-lazy-idle-seconds 3)
  (setq flyspell-lazy-window-idle-seconds 30))
;; Ispell:1 ends here

;; [[file:config.org::*Just][Just:1]]
(after! projectile
  (add-to-list 'projectile-project-root-files "justfile")
  (add-to-list 'projectile-project-types '(just marker-files ("justfile") project-file "justfile" compilation-dir nil
                                           configure-command "just config" compile-command "just build" test-command
                                           "just test" install-command "just install" package-command nil
                                           run-command "just run"))
  )

(use-package! justl
  :config
  (map!
   (:map justl-mode-map
    :n "e" #'justl-exec-recipe
    :n "E" #'justl-exec-vterm
    :n "w" #'justl-no-exec-vterm
    :n "f" #'justl-go-to-file
    )
   :leader :desc "justl" :n "j" #'justl
   ))
;; Just:1 ends here

;; [[file:config.org::*Python][Python:1]]
(after! python
  (setq! +python-ipython-command '("/usr/bin/ipython" "-i" "--simple-prompt" "--no-color-info"))
  (add-hook 'python-mode-hook 'code-cells-mode-maybe)
(after! code-cells
  (map!
   :map code-cells-mode-map
   "C-n" #'code-cells-forward-cell
   :desc "execute cell" "C-c C-c" #'code-cells-eval
   :desc "execute buffer" "C-c C-b" #'python-shell-send-buffer
   :localleader
   :desc "cells" "c" 'code-cells-mode-map
   ))
  )
;; Python:1 ends here

;; [[file:config.org::*Rust][Rust:1]]
(after! rustic rust
  (map!
   :map rustic-mode-map
   :localleader
   :desc "cargo outdated"       "o" #'rustic-cargo-outdated
   :desc "cargo add"            "a" #'rustic-cargo-add
   :desc "cargo add missing"    "A" #'rustic-cargo-add-missing-dependencies
   :desc "visic Cargo.toml"     "t" #'lsp-rust-analyzer-open-cargo-toml
))
;; Rust:1 ends here
